Autodesk.Revit.DB.FabricationConfigurationInfo.AddConfig(System.Boolean)
Adds this fabrication configuration.
bCloudConfig:
Whether to
Returns:
returns whether the configuration was added successfully.
Since:
2016

Autodesk.Revit.DB.FabricationConfigurationInfo.AddCached(System.String,System.String,System.String)
Adds a fabrication configuration.
name:
The fabrication configuration name.
path:
The path where fabrication configuration located.
id:
The cloud Id of the config
Returns:
returns whether the configuration was added successfully.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2016

Autodesk.Revit.DB.FabricationConfigurationInfo.Compare(Autodesk.Revit.DB.FabricationConfigurationInfo)
Whether one configuration is the same as another one, or may be compatible if not.
Returns:
return zero for an exact match. Positive values indicate a partial match, with the lower value being closer. Negative values indicate no match.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2019

Autodesk.Revit.DB.FabricationConfigurationInfo.IsEqual(Autodesk.Revit.DB.FabricationConfigurationInfo)
Checks if the two configuration are the same(e.g. if they have the same GUID and version).
fc:
The other FabricationConfigurationInfo object to compare.
Returns:
True if the two configuration are the same.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2016

Autodesk.Revit.DB.FabricationConfigurationInfo.CreateCloudConfig(System.String,System.String,System.Guid,System.Double,Autodesk.Revit.DB.UnitSystem,System.String)
constructor of FabricationConfigurationInfo for cloud configurations
Returns:
returns config info for cloud config
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2016

Autodesk.Revit.DB.FabricationConfigurationInfo.FindSourceFabricationConfiguration(Autodesk.Revit.DB.FabricationConfigurationInfo)
Finds the source fabrication configuration on disk which matches the input fabrication configuration.
Remarks:
Fabrication configuration is matched by configuration GUID and version. The GUIDs are required to be the same.
For version, we first try to match the version exactly. If Revit cannot find an exact match, then it looks for
the closest version later than the input configuration, then the closest earlier version.
fabricationConfiguration:
The fabrication configuration to match.
Returns:
The matching source fabrication configuration.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2016

Autodesk.Revit.DB.FabricationConfigurationInfo.Path
The path where the fabrication configuration is located. To populate this property,
you may need to call FindSourceFabricationConfiguration first.
Since:
2016

Autodesk.Revit.DB.FabricationConfigurationInfo
Represents an MEP object that holds the properties of an MEP fabrication configuration.
Remarks:
To populate the Path property, you may need to call
FindSourceFabricationConfiguration first.
Since:
2016